In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('/home/krishna/Downloads/taitanic-train/taitanic-train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head(3)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250

In [5]:
target =df.Survived
inputs =df.drop('Survived',axis='columns')

In [6]:
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [7]:
dummies =pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [8]:
inputs =pd.concat([inputs,dummies],axis='columns')

In [9]:
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [11]:
inputs.columns [inputs.isna().any()]

Index(['Age'], dtype='object')

In [17]:
inputs.Age =inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

# Now splitting our data into train, test

In [18]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [19]:
len(x_train)

712

In [20]:
len(x_test)

179

In [21]:
len(y_train)

712

In [22]:
len(inputs)

891

In [24]:
from sklearn.naive_bayes import GaussianNB

In [25]:
model=GaussianNB()

In [26]:
model.fit(x_train,y_train)
model.score(x_test,y_test)

0.7821229050279329

In [27]:
x_test[:10]

     Pclass   Age     Fare  female  male
441       3  20.0   9.5000       0     1
822       1  38.0   0.0000       0     1
175       3  18.0   7.8542       0     1
450       2  36.0  27.7500       0     1
288       2  42.0  13.0000       0     1
757       2  18.0  11.5000       0     1
472       2  33.0  27.7500       1     0
193       2   3.0  26.0000       0     1
467       1  56.0  26.5500       0     1
728       2  25.0  26.0000       0     1

In [28]:
y_test[:10]

441    0
822    0
175    0
450    0
288    1
757    0
472    1
193    1
467    0
728    0
Name: Survived, dtype: int64

In [29]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 0, 0, 1, 0, 0, 0])

In [30]:
#from this we can know that how many percentage people can survived and how much people cannot survived  like 0.98 means 98% people cannot survived and 2% people can survived 
model.predict_proba(x_test[:10])

array([[0.98721967, 0.01278033],
       [0.92023729, 0.07976271],
       [0.98665346, 0.01334654],
       [0.9754391 , 0.0245609 ],
       [0.97638363, 0.02361637],
       [0.97262884, 0.02737116],
       [0.02232973, 0.97767027],
       [0.95518475, 0.04481525],
       [0.89748338, 0.10251662],
       [0.97428305, 0.02571695]])